### Group The Data

#### 1. Split The Object And COmbne The Result

The <b>groupby()</b> method is used in Pandas to split the object. We can define <b>groupby()</b> as grouping the rows.columns into specific groups.

In [19]:
import pandas as pd
import numpy as np

#data 

data = {
    "Player":['Kosal','Raj','Panthi','Anjal','Anjalina'],
    "Rank":[1,4,3,2,5],
    "Points":[10,8,3,9,2],
    "Year":[2000, 2004, 2005,2001,2009]
}

#dataframe

df = pd.DataFrame(data)

df

     Player  Rank  Points  Year
0     Kosal     1      10  2000
1       Raj     4       8  2004
2    Panthi     3       3  2005
3     Anjal     2       9  2001
4  Anjalina     5       2  2009

In [20]:
#group by player
res = df.groupby('Player')
res.first()

          Rank  Points  Year
Player
Anjal        2       9  2001
Anjalina     5       2  2009
Kosal        1      10  2000
Panthi       3       3  2005
Raj          4       8  2004

#### 2. Iterate THe Group

In [21]:
#iterate

for name, group in res:
    print(name)
    print("\n\n", group)

Anjal


   Player  Rank  Points  Year
3  Anjal     2       9  2001
Anjalina


      Player  Rank  Points  Year
4  Anjalina     5       2  2009
Kosal


   Player  Rank  Points  Year
0  Kosal     1      10  2000
Panthi


    Player  Rank  Points  Year
2  Panthi     3       3  2005
Raj


   Player  Rank  Points  Year
1    Raj     4       8  2004

#### 3. View The Group

Use the group property to view the group

In [22]:
df.groupby('Player').groups

{'Anjal': [3], 'Anjalina': [4], 'Kosal': [0], 'Panthi': [2], 'Raj': [1]}

#### 4. Aggregation Operations On Groups

After grouping, we can perform operations on the grouped data using the <b>agg()</b> method. Through this method, we can get the mean or even get the size of each group , etc.

##### a> Get the mean of the grouped data

In [23]:
df

     Player  Rank  Points  Year
0     Kosal     1      10  2000
1       Raj     4       8  2004
2    Panthi     3       3  2005
3     Anjal     2       9  2001
4  Anjalina     5       2  2009

In [26]:
dfRes=df.groupby("Year")

print("\n", dfRes['Points'].agg(np.mean))

 Year
2000    10.0
2001     9.0
2004     8.0
2005     3.0
2009     2.0
Name: Points, dtype: float64

/tmp/ipykernel_5513/2639187618.py:3: FutureWarning: The provided callable <function mean at 0x7f350c79ce00> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  print("\n", dfRes['Points'].agg(np.mean))

##### b> Get the size of each group

To get the size of each group , use the Numpy <b>size</b> attribute in Pandas.

In [27]:
dfRes.agg(np.size)

      Player  Rank  Points
Year
2000       1     1       1
2001       1     1       1
2004       1     1       1
2005       1     1       1
2009       1     1       1